Комплексная_автоматизация_2_МОМ_2019/src/Catalogs/ДрагоценныеМатериалы/ДрагоценныеМатериалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДрагоценныеМатериалы</name>
  <predefined>
    <items>
      <name>Алмазы</name>
      <description>Алмазы</description>
    </items>
    <items>
      <name>Золото</name>
      <description>Золото</description>
    </items>
    <items>
      <name>Иридий</name>
      <description>Иридий</description>
    </items>
    <items>
      <name>Осмий</name>
      <description>Осмий</description>
    </items>
    <items>
      <name>Палладий</name>
      <description>Палладий</description>
    </items>
    <items>
      <name>Платина</name>
      <description>Платина</description>
    </items>
    <items>
      <name>ПлатинаВЛабораторнойПосудеДляХиманализов</name>
      <description>Платина в лабораторной посуде для химанализов</description>
    </items>
    <items>
      <name>ПлатинородиевыеТермопары</name>
      <description>Платинородиевые термопары</description>
    </items>
    <items>
      <name>Родий</name>
      <description>Родий</description>
    </items>
    <items>
      <name>Рутений</name>
      <description>Рутений</description>
    </items>
    <items>
      <name>Серебро</name>
      <description>Серебро</description>
    </items>
    <items>
      <name>СолиСеребраДляХиманализов</name>
      <description>Соли серебра для химанализов в пересчете на металл</description>
    </items>
    <items>
      <name>СусальноеЗолото</name>
      <description>Сусальное золото</description>
    </items>
  </predefined>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

Комплексная_автоматизация_2_МОМ_2019/src/Catalogs/ДрагоценныеМатериалы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняется заполнение реквизитов предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДрагоценныеМатериалы() Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетДрагоценныхМатериалов") Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиПредопределенныхЭлементов = НастройкиПредопределенныхЭлементов();
	
	Если НастройкиПредопределенныхЭлементов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеКодов = НастройкиПредопределенныхЭлементов.СоответствиеКодов;
	РеквизитыТаблица = НастройкиПредопределенныхЭлементов.РеквизитыТаблица;
	
	НачатьТранзакцию();
	
	Попытка
		
		Для Каждого СтрокаТаблРеквизитов Из РеквизитыТаблица Цикл
			
			ЕдиницаИзмерения = СоответствиеКодов.Получить(СтрокаТаблРеквизитов.ЕдиницаИзмеренияЧисловойКод);
			Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
				Объект = Справочники.ДрагоценныеМатериалы[СтрокаТаблРеквизитов.ID].ПолучитьОбъект();
				Объект.ЕдиницаИзмерения = ЕдиницаИзмерения;
				Объект.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Заполнение предопределенных драгоценных материалов'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

// Проверяет заполнение табличной части с содержанием драгоценных материалов
//
// Параметры:
// 		Объект - СправочникОбъект.ДрагоценныеМатериалы - Объект проверки
// 		ТабличнаяЧасть - ТабличнаяЧасть - Проверяемая табличная часть объекта
// 		Отказ - Булево - Признак найденной ошибки при проверке заполнения.
//
Процедура ПроверитьЗаполнениеДрагоценныхМатериалов(Объект, ТабличнаяЧасть, Отказ) Экспорт
	
	ШаблонТекстаОшибки = НСтр("ru='Не заполнена колонка ""Классификация для 1-ДМ"" в строке %1 списка ""Драгоценные металлы и камни""'");
	Для н=0 По ТабличнаяЧасть.Количество()-1 Цикл
		Если ТабличнаяЧасть[н].ДрагоценныйМатериал = Справочники.ДрагоценныеМатериалы.Алмазы
			И Не ЗначениеЗаполнено(ТабличнаяЧасть[н].Расположение) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, Формат(н+1, "ЧГ=0")),
				Объект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДрагоценныеМатериалы", н+1, "Расположение"),
				"Объект",
				Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НастройкиПредопределенныхЭлементов()

	РеквизитыXML = Справочники.ДрагоценныеМатериалы.ПолучитьМакет("НастройкиПредопределенныхЭлементов").ПолучитьТекст();
	РеквизитыТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(РеквизитыXML).Данные;
	
	СтрокаКодов = "";
	Для Каждого СтрокаТаблРеквизитов Из РеквизитыТаблица Цикл
		СтрокаКодов = СтрокаКодов + "," + СтрокаТаблРеквизитов.ЕдиницаИзмеренияЧисловойКод;
	КонецЦикла;
	Если ПустаяСтрока(СтрокаКодов) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СоответствиеКодов = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора(Сред(СтрокаКодов, 2));
	
	Возврат Новый Структура("РеквизитыТаблица,СоответствиеКодов", РеквизитыТаблица, СоответствиеКодов);

КонецФункции

#КонецОбласти

#КонецЕсли
